#include <iostream>

/**
 * Page 33, ex.2.7
 * Що виводиться на екран за такими двома програмами?
 * Поясніть різницю між ними.
 */

using namespace std;

void example1()
{
    // Число 13
    cout << 13; cout << '\n';
    /**
     * Ціла константа, що починається з 0 й далі
     * містить цифри від 0 до 7, є вісімковою.
     * Наприклад, константи 0 та 010 позначають числа 0 та 8, відповідно.
     */
    cout << 013; cout << '\n';
    /**
     * Запис
     * шістнадцяткових констант починається символами 0x
     * або 0x. Наприклад, константа 0x11 позначає число 17.
     */
    cout << 0x11; cout << endl;
    cout << 0x13; cout << endl;
}

void example2()
{
    // Строки (type string)
    cout << "13"; cout << '\n';
    cout << "013"; cout << '\n';
    cout << "0x13"; cout << endl;
}

int main()
{
    example1();
    example2();

    system("pause");
    return 0;
}
