#include <iostream>
#include <string>

/**
 * Page 33, ex.2.6
 * Пояснити різницю між
 * а) 0, '\0' та '0';
 * б) 123 та "123".
 */

using namespace std;

int main()
{
    int i = 0; // число 0 (type Integer)
    char c0 = '0'; // символ 0
    /*
     * До значення, заданого рядковою константою, у пам'яті додається символ '\0',
     * який позначає кінець послідовності символів.
     * Окрім того, якщо в константі присутній символ '\0',
     * то значенням, яке вона задає, є послідовність символів перед '\0'.
     */
    char c1 = '\0';
    // строка
    string s = "\"A'BC\"\0zz"; // result : "A'BC"
    string ex = "Hello World!\0test"; // result : Hello World!
    /**
     * '\0' є символом NULL, ви можете знайти його у своєму
     * ASCII Table, він має значення 0.
     * Він використовується для визначення кінця рядків у стилі C.
     */
    cout << i << endl;
    cout << c0 << endl << c1 << endl;
    cout << s << endl << ex << endl;

    system("pause");
    return 0;
}
